grblHAL/ESP32/main/driver.c
#if SPINDLE_HUANYANG > 0
#if MODBUS_ENABLE && defined(MODBUS_DIRECTION_PIN)
    huanyang_init(modbus_init(serial2Init(115200), serial2Direction));
#else
    huanyang_init(modbus_init(serial2Init(115200), NULL));
#endif
#endif

#if WIFI_ENABLE
    wifi_init();
#endif

#if BLUETOOTH_ENABLE
    bluetooth_init();
#endif

#if TRINAMIC_ENABLE
    trinamic_init();
#endif

#if KEYPAD_ENABLE
    keypad_init();
#endif

//    grbl_esp32_if_init();

//    my_plugin_init(); causes run time crash for some silly reason

    // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 8;
}

/* interrupt handlers */

// Main stepper driver
IRAM_ATTR static void stepper_driver_isr (void *arg)
{
    TIMERG0.int_clr_timers.t0 = 1;
    TIMERG0.hw_timer[STEP_TIMER_INDEX].config.alarm_en = TIMER_ALARM_EN;

    hal.stepper.interrupt_callback();
}

  //GPIO intr process
IRAM_ATTR static void gpio_isr (void *arg)
{
    bool debounce = false;
    uint32_t grp = 0, intr_status[2];
    intr_status[0] = READ_PERI_REG(GPIO_STATUS_REG);          // get interrupt status for GPIO0-31
    intr_status[1] = READ_PERI_REG(GPIO_STATUS1_REG);         // get interrupt status for GPIO32-39
    SET_PERI_REG_MASK(GPIO_STATUS_W1TC_REG, intr_status[0]);  // clear intr for gpio0-gpio31
    SET_PERI_REG_MASK(GPIO_STATUS1_W1TC_REG, intr_status[1]); // clear intr for gpio32-39

    uint32_t i = sizeof(inputpin) / sizeof(input_signal_t);
    do {
        i--;
        if(intr_status[inputpin[i].offset] & inputpin[i].mask) {
            inputpin[i].active = true;
            if(inputpin[i].debounce)
                debounce = true;
            else
                grp |= inputpin[i].group;
        }
    } while(i);

    if(debounce) {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xTimerStartFromISR(debounceTimer, &xHigherPriorityTaskWoken);
    }

    if(grp & PinGroup_Limit)
        hal.limits.interrupt_callback(limitsGetState());

    if(grp & PinGroup_Control)
        hal.control.interrupt_callback(systemGetState());

#if MPG_MODE_ENABLE

    static bool mpg_mutex = false;

    if((grp & PinGroup_MPG) && !mpg_mutex) {
        mpg_mutex = true;
        modeChange();
        // hal.delay_ms(50, modeChange); // causes intermittent panic... stacked calls due to debounce?
        mpg_mutex = false;
    }
#endif

#if KEYPAD_ENABLE
    if(grp & PinGroup_Keypad)
        keypad_keyclick_handler(gpio_get_level(KEYPAD_STROBE_PIN));
#endif
}
